# Append Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeVertexArray..::..Append Method
SlabShapeVertexArray Class See Also
---
Add the item to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	SlabShapeVertex item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As SlabShapeVertex _
)
```

Visual C++
---
```text
public:
virtual void Append(
	SlabShapeVertex^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..SlabShapeVertexThe item to be added.
# See Also
SlabShapeVertexArray Class
Autodesk.Revit.DB Namespace